cases/Day-2/Part_2.1_tubeConvParaview/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 70;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 70;
    }
    outlet
    {
        type            zeroGradient;
        
    }
    
    walls
    {
        type            mixed;
        refValue        uniform 298.15;
        refGradient     uniform 0;
        
        // k laminar
        // valueFraction   uniform 0.137;
        // Heat flux approximation using turbulent
        // thermal conductivity equal to 0.9 W/mK
        valueFraction   uniform 0.0239;
    }
}


// ************************************************************************* //
