cases/Day-2/Part_2.1_tubeConvParaview/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         12;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.75;

maxDeltaT       5e-3;

functions
{
    // Calculates temperature gradient vector in the whole domain
    gradT
    {
        // Mandatory entries (unmodifiable)

        // Function object name
        type            grad;
        libs            (fieldFunctionObjects);

        // Field over which the function objecti will be applied
        field           T;

        // Optional (inherited) entries
        result          gradT;
        region          region0;
        writeControl    writeTime;
    }

    // Integrate wall temperature gradient across the complete
    // tupe. This cimprises all values in z and theta. Multiply this
    // value by the effective thermal conductivity to find
    // the heat flow
    dTdn
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        log             yes;
        writeFields     no;
        regionType      patch;
        name            walls;
        operation       areaNormalIntegrate;

        fields
        (
            gradT
        );
    }
}

// ************************************************************************* //
